{
	"Header.Item1": "About me",
	"Header.Item2": "Experience",
	"Header.Item3": "Work",
	"Header.Item4": "Testimonial",
	"Header.Item5": "Contact",
	"Header.cvBtn": "Resume",
	"Header.cvName": "A3.pdf",
	"Banner.Pretitle": "Hello! My name is",
	"Banner.Description": "I’m an <span class='underline'>AI engineer</span> with a strong passion for <span class='underline'>artificial intelligence, machine learning,</span> <span class='underline'>and data-driven problem solving.</span> My projects explore how AI can be applied to real-world challenges—ranging from building intelligent models to developing end-to-end solutions that combine theory with practical implementation.",
	"Banner.ActionBtn": "Get in touch",
	"AboutMe.Title": "About me",
	"AboutMe.Paragraphs": [
		"I’m a Computer Science graduate with a focus on artificial intelligence and machine learning. My work centers on designing AI solutions that are not only technically strong but also meaningful in solving real-world problems. I’m passionate about exploring the future of AI—from automation to creativity—and aim to contribute to projects that shape how people interact with technology.",
		"Some of the technologies that I have been trained and worked on include (but are not limited to):"
	],
	"AboutMe.conclude": [
		"So that's a bit about me. Can't wait to bring my skills and passion to some more exciting projects!"
	],
	"FeatureProjects.Title": "Some Websites I've Built in the Past",
	"FeatureProjects.Label": "Featured Project",
	"FeatureProjects.Projects": [
		{
			"Title": "(Input Title of Project)",
			"Description": "(Input Description of Project)",
			"imgs": [
				"assets/images/..",
				"assets/images/.."
			],
			"demoLink": "https://www.google.com/",
			"ghLink": "(Enter Github Link)",
			"Technologies": [
				"(Enter Things Used to Create Project)"
			]
		}
	],
	"OtherProjects.Title": "Other Noteworthy Web Applications",
	"OtherProjects.Projects": [
		{
			"Title": "Horiseon",
			"Description": "Application based on removing repeated lines and adding necessary elements in ways that the website will still appear the same.",
			"ghLink": "https://github.com/dcollan/horiseon-refactor-homework",
			"demoLink": "https://dcollan.github.io/-refactor-homework/",
			"Technologies": ["HTML", "CSS"]
		},
		{
			"Title": "Excellent Password Generator",
			"Description": "Webpage that allows for user to create a new randomly generated password to have shown on screen. Upon clicking 'Generate Password', the user will be provided with a prompt indicating how long their password will be, ranging from 8 to 128 (inclusively). After entering, the user will then be asked if any lowercase, uppercase, numbers, or special characters will be included in the password.",
			"ghLink": "https://github.com/dcollan/excellent-password-generator",
			"demoLink": "https://dcollan.github.io/excellent-password-generator/",
			"Technologies": ["HTML", "CSS", "JavaScript"]
		},
		{
			"Title": "Work Day Scheduler",
			"Description": "Work schedule web app that allows so that, once the user clicks save after entering in text to a textfield (whether it is before, in between, or after 9am-5pm), the entered text will yet remain after refreshing the page. There will be different timeblocks for past, present, and future, and while this is all done using Day.js, the current date will also be displayed at the top of the page.",
			"ghLink": "https://github.com/dcollan/work-day-scheduler",
			"demoLink": "https://dcollan.github.io/work-day-scheduler/",
			"Technologies": ["HTML", "CSS", "jQuery", "Day.js"]
		},
		{
			"Title": "Fantastic Weather App",
			"Description": "Weather website that returns the current weather for a specific entered city once the user clicks submit on a form field. Upon submit, the page will also return the predicted forecast for the next five days, where all of the searches the user has done will be displayed onscreen based on the local storage.",
			"ghLink": "https://github.com/dcollan/fantastic-weather-app",
			"demoLink": "https://dcollan.github.io/fantastic-weather-app/",
			"Technologies": ["HTML", "CSS", "jQuery", "AJAX", "APIs"]
		},
		{
			"Title": "Quiz Biz",
			"Description":  "Quiz game based on a timer initiating as soon as the user clicks start. Once the user begins the quiz, the timer will countdown until zero, and there will be a 20 second deduction in seconds if the user answers a question incorrectly. Once the user has successfully answered all questions or the timer hits 0, the results page will display, where this will be saved to local storage.",
			"ghLink": "https://github.com/dcollan/quiz-biz",
			"demoLink": "https://dcollan.github.io/quiz-biz/",
			"Technologies": ["HTML", "CSS", "JavaScript"]
		},
		{
			"Title": "Express Note Taker",
			"Description":  "Note-taking application that prompts user to begin by clicking on a button regarding whether to create a new note. Once the button is clicked, a text field will be provided, prompting the user to enter in a note title with a note description. There will be a save button provided, in which once the user clicks 'Save', the note will be saved and stored. User is also able to delete notes, if needed.",
			"ghLink": "https://github.com/dcollan/express-note-taker",
			"demoLink": "https://express-note-taker3-38445df5a0b6.herokuapp.com/",
			"Technologies": ["JavaScript", "Heroku", "Node.js", "Express.js"]
		},
		{
			"Title": "Unique SQL Employee Tracker",
			"Description":  "Employee tracker terminal app that uses mysql2 and inquirer. Provided with a selection of options to choose from, the user has the choice to view a list of employees, view a list of roles, view a list of departments, add new employees, add new departments, add new roles, or simply update existing employee roles, where they will also have the option to exit the application.",
			"ghLink": "https://github.com/dcollan/unique-sql-employee-tracker",
			"demoLink": "https://www.youtube.com/watch?v=9AJjRyGpiNw",
			"Technologies": ["JavaScript", "MySQL", "Node.js", "Inquirer"]
		},
		{
			"Title": "Groovy README Generator",
			"Description":  "README.md generator terminal app that allows so that the user will be first provided with a series of prompts to answer, where all input data will then be stored into a new README.md file.",
			"ghLink": "https://github.com/dcollan/groovy-readme-generator",
			"demoLink": "https://www.youtube.com/watch?v=BGW5I8wH-Gg",
			"Technologies": ["JavaScript", "Node.js", "Inquirer"]
		},
		{
			"Title": "Super SVG Generator",
			"Description":  "SVG generator terminal app that uses the Jest and Inquirer. Application is based on testing and generating a new SVG file that renders in the shape of a square, circle, or triangle based on the user's input. The user will also be prompted to enter at most 3 text characters to be used inside of the shape. Once the user finishes all prompts, the new SVG file will then be generated.",
			"ghLink": "https://github.com/dcollan/super-svg-generator",
			"demoLink": "https://www.youtube.com/watch?v=hcGHbK2LqGY",
			"Technologies": ["JavaScript", "Node.js", "Inquirer", "Jest"]
		},
		{
			"Title": "Funky ORM App",
			"Description":  "Ecommerce CRUD app that will use Postman/Insomnia. In localhost:3001, the application will execute GET, POST, PUT, or DELETE commands on the database's queries based on the user's requests.",
			"ghLink": "https://github.com/dcollan/funky-orm-app",
			"demoLink": "https://www.youtube.com/watch?v=uBGy4H8eJ5Y",
			"Technologies": ["JavaScript", "Dotenv", "Express.js", "MySQL", "Sequelize", "Postman"]
		},
		{
			"Title": "True Tech Blog",
			"Description":  "Fully-functional, responsive web app that allows for users to register a new account, and be able to login, where their information is stored inside a database. Once they have either created a new account or successfully logged in, they will be granted the option to be able to create a new post that can be shared in a global landing page.",
			"ghLink": "https://github.com/dcollan/true-tech-blog",
			"demoLink": "https://blooming-peak-29118-29e0be2b30b7.herokuapp.com/",
			"Technologies": ["HBS", "JavaScript", "Node.js", "Bcrypt", "Sequelize", "Express.js", "MySQL"]
		},
		{
			"Title": "NoSQL Social Network API",
			"Description":  "NoSQL application that performs CRUD operations using MongoDB. Here, Postman/Insomnia will be used to successfully work with 'user' and 'thought' schemas. When running, GET, POST, PUT, and DELETE operations can be executed by the user as long as they are inside of Postman/Insomnia using 'localhost:3001/'. In the process of deleting a user, their associated thoughts will also be deleted.",
			"ghLink": "https://github.com/dcollan/nosql-social-network-api",
			"demoLink": "https://www.youtube.com/watch?v=hpfKxUrX6IU",
			"Technologies": ["JavaScript", "Node.js", "Express.js", "MongoDB"]
		},
		{
			"Title": "Fabulous PWA Text Editor",
			"Description":  "Progressive web application that successfully renders a text editor the user could open on localhost:3000. The basis of the application will use webpack plugins, including IndexedDB, so that it may be able to store the saved information the user has entered for referring to for later use, even when offline.",
			"ghLink": "https://github.com/dcollan/fabulous-pwa-text-editor",
			"demoLink": "https://fabulous-pwa-text-editor.onrender.com/",
			"Technologies": ["HTML", "CSS", "JavaScript", "Node.js", "Express.js", "Babel", "Insomnia"]
		}
	],
	"Contact.Pretitle": "What’s Next",
	"Contact.Title": "Get in touch!",
	"Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. Simple one-page design that features a profile letter with basic information about a person.",
	"Contact.Btn": "Say Hello"
}
